# 1.1. Сумма трёх
# Посчитайте сумму трёх введённых целых чисел

# a = int(input('Введите число: '))
# b = int(input('Введите число: '))
# c = int(input('Введите число: '))
# print(a, '+', b, '+',  c, '=', a + b + c)

# 1.2. Площадь
# Пользователь вводит стороны прямоугольника, выведите его площадь

# a = int(input('Введите первую сторону прямоугольника: '))
# b = int(input('Введите вторую сторону прямоугольника: '))
# print('S прямоугольника =', a * b)

# 1.3.  Периметр
# Пользователь вводит стороны прямоугольника, выведите его периметр

# a = int(input('Введите бОльшую сторону прямоугольника: '))
# b = int(input('Введите меньшую сторону прямоугольника: '))
# print('P прямоугольника =', (a + b) * 2)

# 1.4. Площадь круга
# Пользователь вводит радиус круга, выведите площадь круга

# r = float(input('Введите радиус круга:'))
# pi = 3.14
# print('S круга =', pi * r * r)

# 1.5. Сумма дробных
# Посчитайте сумму трёх введённых дробных чисел

# a = 1.5
# b = 2.5
# c = 1.1
# print(a + b + c)

# 1.6. Школьники и яблоки
# n школьников делят k яблок поровну, неделящийся остаток остаётся в корзинке.
# Сколько яблок достанется каждому школьнику? Сколько яблок останется в корзинке?

# a = int(input('Количесво школьников:'))
# b = int(input('Количество яблок:'))
# print('Яблок останется каждому:', int(a / b))
# print('Останестя яблок в корзине:', a % b)